// Домашнее задание 5. (после 12 урока)
// +++++++++++++++++++++++++++++++++++++++++++++++
// 1. Написать программу, которая через prompt считывает число и выводит в
// консоль число равное 10% от введенного числа

// const userNumber = +prompt("Введите любое число")
// console.log(`10% от числа ${userNumber} это ${(userNumber / 100) * 10}`);

// +++++++++++++++++++++++++++++++++++++++++++++++
// 4. Написать программу, которая запрашивает у пользователя его имя 
// и возраст (в годах) и выводит в консоль сообщение ‘Hello, <name>’, если
// пользователь совершеннолетний, или ‘Hi, <name>’, если пользователь
// несовершеннолетний.

// const userName = prompt(`Введите Ваше имя`);
// const userAge = +prompt(`Введите Ваш возраст`);
// if (userAge <= 16) {
//     console.log(`Hi, ${userName} `)
// } else {
//     console.log(`Hello, ${userName} `)
// };

// +++++++++++++++++++++++++++++++++++++++++++++++
// 2. Написать программу, которая получает два числа и выводит наименьшее
// const numFirst = +prompt(`Введите Первое число`);
// const numSecond = +prompt(`Введите Второе число`);

// if (numFirst < numSecond) {    
//     console.log(`Первое число  ${numFirst} будет меньше`)
// } 
// else if (numFirst > numSecond) {
//     console.log(`Второе число ${numSecond} будет меньше`)
// } else {
//      console.log("Так не честно :(")
// }

// +++++++++++++++++++++++++++++++++++++++++++++++
// 3. Написать программу, которая считывает через prompt число и выводит 
// одно из следующих сообщений: ‘Число меньше 100’, ‘Число больше 100’ или 
// ‘Число равно 100’

// const numFirst = +prompt(`Введите число`);

// if (100 < numFirst) {    
//     console.log(`Число  ${numFirst} больше 100`)
// } 
// else if (100 > numFirst) {
//     console.log(`Число ${numFirst} меньше 100`)
// } else {
//     console.log(`Число ${numFirst} равно 100`)
// }


